{
  "projectName": "StoryFlowProject",
  "promptTriggers": {
    "@subject": "CONTEXT: A high-fashion photoshoot for a Korean streetwear brand, capturing a single night out in the cool nightlife of Seoul with a carnival atmosphere. The series is shot with the raw, chaotic energy of Daido Moriyama and the cinematic storytelling of Wong Kar-Wai, for i-D magazine. The atmosphere is candid, intimate, and infused with magical realism. SUBJECT: A 25-year-old Korean adult woman with a face reminiscent of Lucy Liu's sharp bone structure and intense expression, complemented by a distinctive Jeju-island tan and pale undertones. Her skin has a dewy texture with visible pores on her nose and cheeks. She has a unique mole below her left eye. Her body is a fuller, soft hourglass figure, 5 feet 9 inches tall, with a soft waist, full hips and thighs, and large, heavy breasts. She is fully clothed in the brand's latest streetwear collection, which consists of oversized silhouettes, technical fabrics, and bold, minimalist designs designed to flatter a curvier body."
  },
  "configShortcuts": {
    "#street": "{\"model\":\"z_image_turbo_1.0_q8p.ckpt\",\"cfgZeroInitSteps\":0,\"shift\":3,\"sampler\":16,\"maskBlur\":1.5,\"hiresFixHeight\":1024,\"height\":1280,\"batchCount\":1,\"strength\":1,\"guidanceScale\":1,\"hiresFixStrength\":0.69999999999999996,\"hiresFix\":true,\"preserveOriginalAfterInpaint\":true,\"cfgZeroStar\":false,\"controls\":[],\"tiledDiffusion\":false,\"causalInferencePad\":0,\"seedMode\":2,\"sharpness\":0,\"seed\":911906239,\"tiledDecoding\":false,\"width\":1280,\"resolutionDependentShift\":false,\"hiresFixWidth\":1024,\"maskBlurOutset\":0,\"loras\":[{\"mode\":\"all\",\"file\":\"detailed_vagina_z_lora_f16.ckpt\",\"weight\":1},{\"mode\":\"all\",\"file\":\"hyper_realist_style_z_lora_f16.ckpt\",\"weight\":0},{\"mode\":\"all\",\"file\":\"pov_z_lora_f16.ckpt\",\"weight\":1}],\"upscaler\":\"\",\"refinerModel\":\"\",\"steps\":8,\"faceRestoration\":\"\",\"batchSize\":1}"
  },
  "poseJSONShortcuts": {},
  "wildcardShortcuts": {
    "$lighting": "Harsh, direct neon light from a 'POCHA' tent sign casting a saturated magenta glow on one side of her face, creating deep, dramatic shadows that accentuate her cheekbones and the texture of her jacket. | Soft, diffused fluorescence from a 24-hour convenience store window, illuminating her with a clean, mundane light that makes the dewy sheen on her skin and the technical fabric of her pants appear hyper-real. | Dynamic, flickering light from a carnival game stall, with spinning LED lights creating a chaotic pattern of moving colored shadows across her body and the wet pavement, captured with a slow shutter speed for motion blur. | Cinematic backlighting from the headlights of a slowly passing Hyundai sedan, creating a sharp rim light around her silhouette and making the steam from a street food cart glow, with the foreground in deep shadow. | Warm, golden light spilling from the open door of a hidden jazz bar, casting a long, inviting shaft of light across the alley, highlighting the texture of her wool beanie and the nervous anticipation in her eyes. | Magical, ethereal light emanating from a cluster of floating, luminescent lampionella flowers (a magical realism element), casting a soft, blue-green glow that makes the sequins on her top sparkle and her skin appear porcelain.",
    "$camera_angle": "Dynamic low-angle shot from knee-level, using a 28mm wide-angle lens, distorting the perspective to make her figure loom powerfully against the chaotic neon skyline, capturing the expanse of the street scene. | Candid, eye-level medium shot with a 50mm prime lens, capturing an intimate moment as if taken by a friend, with a shallow depth of field that keeps her sharp while the bustling crowd behind melts into a bokeh of lights. | Dutch angle shot with a 35mm lens, tilting the frame at 15 degrees to create a sense of disorientation and energy, perfectly framing her between the vertical lines of a construction scaffold and a flashing sign. | Over-the-shoulder perspective, using an 85mm telephoto lens from behind a street food vendor, creating a voyeuristic feel, focusing on her profile as she watches the crowd, with the vendor's shoulder blurry in the foreground. | Unsteady, documentary-style close-up, shot on a 40mm lens with slight camera shake, filling the frame with her face and upper torso, capturing every pore and the reflection of city lights in her eyes. | Wide panoramic shot with a 24mm lens, capturing the entire scene from across the street, making her a single, focused element within the vast, chaotic tapestry of the nightmarket and carnival crowds.",
    "$pose_shot1": "Arrival: She stands at the mouth of a narrow alley, one hand lightly touching the cold brick wall, her body angled away from the camera as she looks down the vibrant, noisy street with a mix of hesitation and excitement. Her oversized bomber jacket is zipped, its bulk contrasting with the curve of her hips. | Arrival: Leaning against a gleaming metal telephone box, she checks her phone, her brow slightly furrowed. Her weight is on one leg, causing the baggy cargo pants to drape around her full thighs. The streetlights catch the subtle sheen of her anxious sweat on her temples. | Arrival: Sitting on the curb, tying the laces of her chunky sneakers, she looks up from under the brim of her bucket hat, making direct eye contact with the camera. Her posture is relaxed but the fabric of her oversized hoodie is pulled taut across her chest. | Arrival: Pausing under the flickering awning of a closed shop, she pulls the collar of her jacket up against the night chill, her shoulders hunched. She glances over her shoulder, her expression cautious yet curious about the carnival sounds, the jacket cinching at her soft waist. | Arrival: Mid-stride, walking into the frame from the shadows, her body is a study in motion. One hand is in the pocket of her tailored trousers, the other holds a keychain that glints. Her face is determined, the streetwear moving fluidly with her confident gait. | Arrival: She is adjusting the straps of her cross-body bag, her body turned three-quarters to the camera. Her gaze is distant, focused on a group of laughing friends further down the street, a faint, hopeful smile touching her lips. The loose-fit shirt she wears drapes softly over her fuller figure.",
    "$pose_shot2": "Immersion: She is caught laughing, head thrown back, as a street vendor offers her a sample of tteokbokki. One hand presses against her chest, the other holds the snack. Her body is open and joyful, the bright red sauce contrasting with her neutral-toned jacket, which falls open to reveal a fitted top that hugs her curves. | Immersion: Squatting down to look at a display of handmade trinkets at a stall, her knees apart, back straight. Her fingers hover over a small object, her expression one of intense concentration. The oversized sleeves of her hoodie pool around her wrists, while the pants tighten around her full thighs. | Immersion: Leaning over a carnival game, her body stretched across the counter, tongue slightly out in concentration as she tries to win a prize. The camera captures her from a low angle, emphasizing the stretch of her body and the way her fitted turtleneck outlines her bust and waist. | Immersion: Dancing awkwardly but joyfully to music from a portable speaker, her arms above her head, eyes closed. The baggy layers of her clothing flow with the movement, but the motion defines the solid, powerful shape of her body beneath. | Immersion: In a moment of quiet observation, she leans against a graffiti-covered electrical box, arms crossed under her bust, watching a busker. Her expression is thoughtful, almost melancholic. The sharp lines of her jacket collar frame her face, and the garment is tailored to accommodate her figure. | Immersion: Accepting a can of beer from a new acquaintance, her fingers brushing against theirs. She smiles shyly, looking down at the ground before taking a sip. Her body language is slightly closed, one foot pointing inward, a moment of vulnerable connection. Her cargo pants are cinched at the ankle, balancing her proportions.",
    "$pose_shot3": "Climax: A moment of euphoric release, spinning in the middle of a spontaneous dance circle, her arms wide, face upturned to the sky. Her hair whips around her face, and her jacket is unzipped, revealing a sleek top that moves with the twists of her torso and hips. The motion blur of the lights echoes her movement. | Climax: Locking eyes with someone across the crowd, she stops dead. Her body is still, but her expression is electric. One hand rises slowly to push her hair back from her face, a gesture that pulls her crop top slightly, highlighting the curve of her waist. | Climax: Lifting a friend onto her shoulders with a grunt of effort, her body straining under the weight but her face breaking into a triumphant grin. The streetwear stretches across her back and shoulders, highlighting her strong build and the powerful curve of her hips supporting the weight. | Climax: A confetti cannon explodes nearby, and she throws her hands up to shield her face, laughing uncontrollably. The pose is defensive yet joyous, catching colorful pieces of paper in her hair and on her clothes. The action causes her oversized shirt to ride up, revealing a sliver of skin above the waistband of her high-waisted pants. | Climax: Leaning in close to hear a secret whispered in her ear amidst the roar of the crowd, her hand on the speaker's arm. Her expression is a mixture of surprise and intimacy, a secluded bubble in the chaos. Her body is turned, emphasizing the soft roundness of her shoulder and the way her jacket fits across her back. | Climax: Standing on a low wall, she looks out over the seething mass of people, a queen surveying her kingdom. Her posture is powerful, hands on hips, the layered streetwear making her silhouette bold and graphic against the night sky, the fabrics draping over her full hips and bust.",
    "$pose_shot4": "Departure: Walking away, arm-in-arm with a companion, their heads leaned together in tired camaraderie. She looks down at her feet, a small, sated smile on her face. The clothes are now rumpled, the jacket tied around her waist, showing the wear of the night and the shape of her body in the fitted layer beneath. | Departure: Sitting on the steps of a subway station, elbows on her knees, head resting in her hands. She looks up at the camera, her makeup slightly smudged, expression weary but content. The relaxed fit of her trousers provides comfort, the fabric pooling around her thighs as she sits. | Departure: Hailing a taxi, one arm raised high, the other wrapped around herself for warmth. Her body is silhouetted against the bright headlights, a tired but determined end to the journey. The silhouette clearly shows the proportions of her fuller figure beneath the streetwear. | Departure: Sharing a last cigarette with a stranger, leaning against a parked car. The smoke curls up into the predawn light, her body relaxed in a way it wasn't at the start of the night. She slouches slightly, the fabric of her hoodie folding softly over her chest and stomach. | Departure: A final look back over her shoulder at the now-quieting carnival, her face in profile. The expression is complex: nostalgia, exhaustion, and the first hint of longing for the next night. The motion causes her hair to sweep across her face and her jacket to pull across her shoulders. | Departure: She is a distant figure under a solitary streetlamp, the graffiti and discarded streamers around her the only evidence of the night's magic. Her hands are in her pockets, her walk slow and purposeful towards home. The oversized coat she wears swings with her gait, hinting at the shape of her body beneath."
  },
  "items": [
    {
      "type": "prompt",
      "value": "Shot 1: Arrival. The environment is a threshold space where a quiet, dimly lit back alley meets the explosive sensory overload of the main Myeongdong nightmarket. The air is thick with the smells of frying mandu and diesel, and the sounds are a chaotic symphony of pop music, vendors, and laughter. The cold concrete underfoot contrasts with the warm neon glow ahead. @subject stands at this precipice, the crisp, new streetwear feeling like both armor and a costume before the night begins. $pose_shot1 $lighting $camera_angle"
    },
    {
      "type": "prompt",
      "value": "Shot 2: Immersion. The environment is the heart of the street carnival, a dense crush of bodies around food stalls and games. Glowing lanterns are strung between buildings, and the flash of smartphone cameras mixes with neon signs for 'HOF' and 'PC Bang'. The ground is littered with receipts and straws, a testament to the night's consumption. @subject is now deep within the crowd, the streetwear beginning to show the night's activity, a participant in the collective energy. $pose_shot2 $lighting $camera_angle"
    },
    {
      "type": "prompt",
      "value": "Shot 3: Climax. The environment is a small plaza where the crowd has spontaneously converged into a dance party. A DJ has set up on a makeshift stage, and the bass vibrates through the pavement. Confetti and smoke fill the air, and the magical realism is palpable—perhaps the stars seem closer, or the colors are unnaturally vivid. This is the peak of the night's euphoria. @subject is at the center of this vortex, the streetwear now a second skin, soaked in sweat and light, embodying the brand's fusion of style and lived experience. $pose_shot3 $lighting $camera_angle"
    },
    {
      "type": "prompt",
      "value": "Shot 4: Departure. The environment is the aftermath. The carnival is winding down; vendors are closing, and the crowds have dissipated, leaving behind an emptiness echoed by the gray light of dawn touching the skyscrapers. The magic has faded, leaving only the tangible reality of the city. Trash drifts across the pavement. @subject moves through this quiet landscape, the streetwear now bearing the wrinkles and stains of a story lived, a tangible record of the night's journey from anticipation to memory. $pose_shot4 $lighting $camera_angle"
    },
    {
      "type": "prompt",
      "value": "no text, no watermark, no logos, no branding"
    }
  ]
}